In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X', 'X', 'Y', 'Y', 'Z'],
                    'k2':['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.272359  0.301576
1  X   beta  0.653489  0.894150
2  Y  alpha -0.173888  1.475871
3  Y   beta  1.853096 -1.439762
4  Z  alpha -1.265713  0.368652

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X    0.462924
Y    0.839604
Z   -1.265713
Name: dataset1, dtype: float64

In [11]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])

In [12]:
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [13]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.653489
    JAN   -0.173888
NY  FEB    1.853096
    JAN   -0.496677
Name: dataset1, dtype: float64

In [14]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.272359  0.301576
1  X   beta  0.653489  0.894150
2  Y  alpha -0.173888  1.475871
3  Y   beta  1.853096 -1.439762
4  Z  alpha -1.265713  0.368652

In [15]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.462924  0.597863
Y   0.839604  0.018055
Z  -1.265713  0.368652

In [16]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.272359  0.301576
   beta   0.653489  0.894150
Y  alpha -0.173888  1.475871
   beta   1.853096 -1.439762
Z  alpha -1.265713  0.368652

In [19]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [22]:
for name, group in dframe.groupby('k1'):
    print('This is the %s group' %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.272359  0.301576
1  X   beta  0.653489  0.894150


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.173888  1.475871
3  Y   beta  1.853096 -1.439762


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -1.265713  0.368652

In [24]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print(f'key1 = {k1} Key2 = {k2}')
    print(group)
    print('\n')

key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.272359  0.301576


key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  0.653489   0.89415


key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.173888  1.475871


key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  1.853096 -1.439762


key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -1.265713  0.368652

In [25]:
group_dict = dict(list(dframe.groupby('k1')))

In [26]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.272359  0.301576
1  X   beta  0.653489  0.894150

In [27]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [28]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.272359  0.301576
 1  0.653489  0.894150
 2 -0.173888  1.475871
 3  1.853096 -1.439762
 4 -1.265713  0.368652,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [29]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.301576
   beta   0.894150
Y  alpha  1.475871
   beta  -1.439762
Z  alpha  0.368652

In [30]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.272359  0.301576
1  X   beta  0.653489  0.894150
2  Y  alpha -0.173888  1.475871
3  Y   beta  1.853096 -1.439762
4  Z  alpha -1.265713  0.368652

In [ ]:
s